In [1]:
import warnings
import numpy as np
import pandas as pd

warnings.filterwarnings('ignore')
pd.options.display.max_rows = None
pd.options.display.max_columns = None
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [2]:
df = pd.read_csv("C:/Users/Lenovo/Documents/Retail Sales Dataset/retail_sales_dataset.csv")

In [3]:
df.shape

(1000, 9)

In [4]:
df.columns

Index(['Transaction ID', 'Date', 'Customer ID', 'Gender', 'Age',
       'Product Category', 'Quantity', 'Price per Unit', 'Total Amount'],
      dtype='object')

In [5]:
df.dtypes

Transaction ID       int64
Date                object
Customer ID         object
Gender              object
Age                  int64
Product Category    object
Quantity             int64
Price per Unit       int64
Total Amount         int64
dtype: object

In [6]:
df.isnull().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [7]:
len(df)

1000

In [8]:
df.drop_duplicates(inplace=True)

In [9]:
len(df) # no duplicated rows

1000

In [10]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [11]:
df.describe()

       Transaction ID     Age  Quantity  Price per Unit  Total Amount
count         1000.00 1000.00   1000.00         1000.00       1000.00
mean           500.50   41.39      2.51          179.89        456.00
std            288.82   13.68      1.13          189.68        560.00
min              1.00   18.00      1.00           25.00         25.00
25%            250.75   29.00      1.00           30.00         60.00
50%            500.50   42.00      3.00           50.00        135.00
75%            750.25   53.00      4.00          300.00        900.00
max           1000.00   64.00      4.00          500.00       2000.00

In [12]:
df['Date'] = pd.to_datetime(df['Date'])
df.sort_values(by='Date', inplace=True)

In [13]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
521,522,2023-01-01,CUST522,Male,46,Beauty,3,500,1500
179,180,2023-01-01,CUST180,Male,41,Clothing,3,300,900
558,559,2023-01-01,CUST559,Female,40,Clothing,4,300,1200
302,303,2023-01-02,CUST303,Male,19,Electronics,3,30,90
978,979,2023-01-02,CUST979,Female,19,Beauty,1,25,25

In [14]:
df.columns

Index(['Transaction ID', 'Date', 'Customer ID', 'Gender', 'Age',
       'Product Category', 'Quantity', 'Price per Unit', 'Total Amount'],
      dtype='object')

* Total Sales Revenue: The sum of the "Total Amount" column, which represents the total revenue generated from all transactions.

In [17]:
total_sales_revenue = df['Total Amount'].sum()
print(f'Toatl sales revenue id {total_sales_revenue}')

Toatl sales revenue id 456000

* Average Transaction Value: The average amount spent per transaction, calculated by dividing the total sales revenue by the number of transactions.

In [18]:
average_transaction_value = total_sales_revenue / len(df)
print(f'Average transaction value {average_transaction_value}')

Average transaction value 456.0

* Sales by Product Category: The total sales revenue broken down by each product category (e.g., Beauty, Clothing, Electronics).

In [20]:
df.pivot_table(values='Total Amount', index='Product Category', aggfunc="sum")

                  Total Amount
Product Category
Beauty                  143515
Clothing                155580
Electronics             156905

* Sales by Gender: The total sales revenue segmented by gender (Male, Female).

In [21]:
df.pivot_table(values='Total Amount', index="Gender", aggfunc="sum")

        Total Amount
Gender
Female        232840
Male          223160

* Sales by Age Group: The total sales revenue segmented by age groups (e.g., 18-25, 26-35, 36-45, etc.).

In [42]:
np.min(df['Age']), np.max(df['Age'])

(18, 64)

In [45]:
def age_groups(x): # segment age into groups
    if 18 <= x < 23:
        return '18-23'
    elif 23 <= x < 28:
        return '23-28' 
    elif 28 <= x < 33:
        return  '28-33'
    elif 33 <= x < 38:
        return '33-38'
    elif 38 <= x < 43:
        return '38-43'
    elif 43 <= x < 48:
        return '43-48'
    elif 48 <= x < 53:
        return '48-53' 
    elif 53 <= x < 58:
        return '53-58'
    elif 58 <= x < 63:
        return '58-63'
    else:
        return '63+'

In [46]:
df['Age groups'] = df['Age'].apply(age_groups)

In [48]:
df.pivot_table(values='Total Amount', index='Age groups', aggfunc='sum')

            Total Amount
Age groups
18-23              61015
23-28              46900
28-33              40800
33-38              55070
38-43              39260
43-48              57450
48-53              45300
53-58              48525
58-63              43305
63+                18375

* Sales Trends Over Time: The total sales revenue over different time periods (e.g., monthly, quarterly).

In [50]:
df['Month'] = df['Date'].dt.month_name(locale='English')

In [52]:
df.pivot_table(values='Total Amount', index='Month', aggfunc='sum')

           Total Amount
Month
April             33870
August            36960
December          44690
February          44060
January           36980
July              35465
June              36715
March             28990
May               53150
November          34920
October           46580
September         23620

In [85]:
df['Quarter'] = df['Date'].dt.quarter
df['Quarter'] = "Quarter " + df['Quarter'].astype(str)

In [88]:
df.pivot_table(values='Total Amount', index='Quarter', aggfunc='sum')

           Total Amount
Quarter
Quarter 1        110030
Quarter 2        123735
Quarter 3         96045
Quarter 4        126190

* Inventory Turnover: The number of times inventory is sold and replaced over a period (calculated using the "Quantity" column).

In [89]:
df.pivot_table(values='Quantity', index='Product Category', aggfunc='sum', columns='Month')

Month,April,August,December,February,January,July,June,March,May,November,October,September
Product Category,,,,,,,,,,,,
Beauty,69,62,62,68,62,70,66,51,65,63,83,50
Clothing,93,78,53,75,72,45,67,111,97,69,74,60
Electronics,52,87,92,71,65,61,64,32,97,73,95,60

In [92]:
df.pivot_table(values='Quantity', index='Product Category', aggfunc='sum', columns='Quarter')

Quarter           Quarter 1  Quarter 2  Quarter 3  Quarter 4
Product Category
Beauty                  181        200        182        208
Clothing                258        257        183        196
Electronics             168        213        208        260

In [54]:
df.pivot_table(values='Quantity', index='Product Category', aggfunc='sum')

                  Quantity
Product Category
Beauty                 771
Clothing               894
Electronics            849

In [96]:
df.to_excel("new data.xlsx", index=False) # in order to visualize data using excel